Deriving Use Cases from System Requirements.

| Actor   | Actor's Goal                                            | Use case name |
| --------| ------------------------------------------------------- | ------------- |
| 분석모듈 | 점주가 주위 지역의 판매 동향 확인                         |               |
| 분석모듈 | 판매 동향 그래프화, 수치화                                |               |
| 분석모듈 | 분기당 해당 브랜드 물품의 판매량 확인                      |               |
| 분석모듈 | 창고의 부족한 재고를 알람                                 |               |
| 분석모듈 | 과년도 판매 동향을 확인                                   |               |
| 분석모듈 | 현재 판매 동향을 확인                                     |               |
| 분석모듈 | 근처 창고의 현재 점주가 필요한 제품 재고 파악               |               |
| 분석모듈 | 근처 창고의 차후 점주가 필요한 제품 재고 파악               |               |
| 분석모듈 | 창고의 재고 현재 리포트 확인                               |               |
| 분석모듈 | 창고의 재고 예측 리포트 확인                               |               |
| 분석모듈 | 어드민, 점주, 창고 관리자 열람 가능                        |               |



** 확인/열람과 같은 기능은 분석모듈의 역할이 아니라고 생각합니다. 동향리포트, 예측리포트 생성의 관점**

| Actor   | Actor's Goal                                            | Use case name |
| --------| ------------------------------------------------------- | ------------- |
| 분석모듈 | 지점의 판매 데이터 수집 ( 데이터 모듈의 역할일수도 있다고 생각 )    |               |
| 분석모듈 | 판매 동향 그래프화, 수치화                                |               |
| 분석모듈 | 분기당 해당 브랜드 물품의 판매량 데이터화                   |               |
| 분석모듈 | 창고의 부족한 재고를 알람 ( 데이터 모듈의 역할? )            |               |
| 분석모듈 | 과년도 판매 동향을 데이터화                                   |               |
| 분석모듈 | 현재 판매 동향을 데이터화                                     |               |
| 분석모듈 | 근처 창고의 현재 점주가 필요한 제품 재고 파악               |               | <-- 어떤 의미인지 잘 모르겠어요.
| 분석모듈 | 근처 창고의 차후 점주가 필요한 제품 재고 예상(?)            |               | <-- 어떤 의미인지 잘 모르겠어요.
| 분석모듈 | 창고의 재고 현재 리포트 생성                               |               |
| 분석모듈 | 창고의 재고 예측 리포트 생성                               |               |


